export const dataDiaryMock = {
  date: '01-02-2023',
  logs: [
    {
      time: '6am',
      action:
        '私の日記の記録が一部表示されます。テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
    },
    {
      time: '7am',
      action:
        '私の日記の記録が一部表示されます。テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
    },
  ],
};

export const dataDiaryDetailsMock = [
  {
    date: '01-02-2023',
    time: '23:25',
    titel: '私の日記の記録が一部表示されます。',
    content:
      ' テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
  },
  {
    date: '02-02-2023',
    time: '23:25',
    titel: '私の日記の記録が一部表示されます。',
    content:
      ' テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
  },
  {
    date: '03-02-2023',
    time: '23:25',
    titel: '私の日記の記録が一部表示されます。',
    content:
      ' テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
  },
  {
    date: '04-02-2023',
    time: '23:25',
    titel: '私の日記の記録が一部表示されます。',
    content:
      ' テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
  },
  {
    date: '05-02-2023',
    time: '23:25',
    titel: '私の日記の記録が一部表示されます。',
    content:
      ' テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
  },
  {
    date: '06-02-2023',
    time: '23:25',
    titel: '私の日記の記録が一部表示されます。',
    content:
      ' テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
  },
  {
    date: '07-02-2023',
    time: '23:25',
    titel: '私の日記の記録が一部表示されます。',
    content:
      ' テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
  },
  {
    date: '08-02-2023',
    time: '23:25',
    titel: '私の日記の記録が一部表示されます。',
    content:
      ' テキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキストテキスト…',
  },
];

export const dataExerciseMock = {
  date: '01-02-2023',
  exercises: [
    {
      time: '10 min',
      name: '家事全般（立位・軽い）',
      burn: '26kcal',
    },
    {
      time: '12 min',
      name: '家事全般（立位・軽い）',
      burn: '30kcal',
    },
    {
      time: '10 min',
      name: '家事全般（立位・軽い）',
      burn: '26kcal',
    },
    {
      time: '12 min',
      name: '家事全般（立位・軽い）',
      burn: '30kcal',
    },
    {
      time: '10 min',
      name: '家事全般（立位・軽い）',
      burn: '26kcal',
    },
    {
      time: '12 min',
      name: '家事全般（立位・軽い）',
      burn: '30kcal',
    },
    {
      time: '10 min',
      name: '家事全般（立位・軽い）',
      burn: '26kcal',
    },
    {
      time: '12 min',
      name: '家事全般（立位・軽い）',
      burn: '30kcal',
    },
    {
      time: '10 min',
      name: '家事全般（立位・軽い）',
      burn: '26kcal',
    },
    {
      time: '12 min',
      name: '家事全般（立位・軽い）',
      burn: '30kcal',
    },
    {
      time: '10 min',
      name: '家事全般（立位・軽い）',
      burn: '26kcal',
    },
    {
      time: '12 min',
      name: '家事全般（立位・軽い）',
      burn: '30kcal',
    },
  ],
};
